---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.InstanceMoveTopWithGrids
source: html/e1df1614-9238-8f51-ae7b-3f29707a69a9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.InstanceMoveTopWithGrids Property

"Move Top With Grids"

## Syntax (C#)
```csharp
public static ForgeTypeId InstanceMoveTopWithGrids { get; }
```